# vim: set ft=ruby:

brew 'bash'
brew 'bash-completion@2'
brew 'git'
brew 'tmux'
brew 'neovim'
brew 'tree-sitter-cli'
brew 'ripgrep'
brew 'bash-language-server'
brew 'shfmt'
brew 'shellcheck'
brew 'deno'

cask 'ghostty'

brew 'azure-cli'
cask 'container'
brew 'container-compose'

brew 'go'
brew 'gopls'

brew 'uv'
brew 'gemini-cli'
cask 'cursor'
cask 'google-chrome'

brew 'mas'
mas "Amphetamine", id: 937984704
mas "uBlock Origin Lite", id: 6745342698
mas "Slack for Desktop", id: 803453959

cask 'tailscale-app'
