# vim: set ft=ruby:

brew 'bash'
brew 'bash-completion@2'
brew 'git'
brew 'tmux'
brew 'neovim'
brew 'tree-sitter-cli'
brew 'ripgrep'
brew 'bash-language-server'
brew 'shfmt'
brew 'shellcheck'
brew 'deno'

cask 'ghostty'

cask 'chatgpt'

brew 'azure-cli'
brew 'container'
brew 'container-compose'

brew 'go'
brew 'gopls'

brew 'mas'
mas "Amphetamine", id: 937984704
mas "uBlock Origin Lite", id: 6745342698

cask 'firefox'
